app/views/posts/_form.html.erb

    <%= form.label :category_id %>
    <%= form.select :category_id, Category.pluck(:name, :id) %>
---
SELECT "categories"."name", "categories"."id" FROM "categories"