app/views/posts/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]
---
				<td><%= post.post_type.name %></td>
        <td><%= post.likes.count %> <%= (post.likes.count) == 1 ? '💙' : '💙'%></td>