app/controllers/admin_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @categories = Category.all
    @users = User.all
    @coments = Coment.all
    @pt=PostType.all
    @user = current_user

    @posts = Post.all