app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "category"], ["description", "k;"], ["created_at", "2020-11-16 12:44:56.491620"], ["updated_at", "2020-11-16 12:44:56.491620"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Лайфстайл"], ["description", "Страница о жизни серфинга"], ["updated_at", "2020-12-17 14:44:34.006977"], ["id", 1]]