app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:body).merge(user_id: current_user.id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "k;"], ["post_id", 1], ["created_at", "2020-11-09 13:37:23.454292"], ["updated_at", "2020-11-09 13:37:23.454292"], ["user_id", 1]]