app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 2], ["created_at", "2020-11-16 12:29:24.910664"], ["updated_at", "2020-11-16 12:29:24.910664"]]
---
  def create
    if already_liked?
      flash[:notice] = "You can't like more than once"
    else
      @post.likes.create(user_id: current_user.id)

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    if !(already_liked?)
      flash[:notice] = "Cannot unlike"
    else
      @like.destroy

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def find_like
    @like = @post.likes.find(params[:id])

SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 2], ["post_id", 1], ["LIMIT", 1]]
---
  def already_liked?
    Like.where(user_id: current_user.id, post_id:
    params[:post_id]).exists?