app/controllers/posts_controller.rb

  def postsMain
    @cities = City.all

    @school = School.find_by_name(params[:school])
    @schools = School.all
    if params.has_key?(:city)
      @city = City.find_by_name(params[:city])
      @schools = School.where(city: @city)
    else
      @schools = School.all
    end


    @categories = Category.all

    @posts = Post.all.includes(:category,:likes, :favorites).map do
      |post|
      post.as_json(include: [:category, :image, :likes, :favorites])
    end
    filtering_params(params).each do |key, value|
    @posts = @posts.public_send("filter_by_#{key}", value).includes(:category, :likes, :favorites)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]