app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "category"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 1]]
SELECT "posts".* FROM "posts"
---
  def index
    @categories = Category.all
    if params.has_key?(:category)
      @category = Category.find_by_name(params[:category])
      @posts = Post.where(category: @category)
    else
      @posts = Post.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # @tag.post_id = Tag.find(@post.tag_id)
    @categories = Category.all
    @category = Category.find(@post.category_id)

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at", "author", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "l;'"], ["title", ";[[]]"], ["content", "l["], ["created_at", "2020-11-09 13:33:30.511939"], ["updated_at", "2020-11-09 13:33:30.511939"], ["author", ""], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "name" = ?, "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["name", "Привет"], ["title", "Это первый заголовок поста"], ["content", "Контент, который ты можешь здесь оставить"], ["updated_at", "2020-09-21 12:47:42.447748"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)