app/controllers/subscribers_controller.rb

INSERT INTO "subscribers" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "df@mial.com"], ["created_at", "2020-10-05 12:32:18.882108"], ["updated_at", "2020-10-05 12:32:18.882108"]]
---
  def create
    @subscriber = Subscriber.new(subscriber_params)
    if @subscriber.save